def area(a,b):
#Принимает длины сторон, равные  a,b(десятичные целые числа), возвращает площадь, равную a*n
#   Пример: area(2,5) = 10 (десятичное целое число)
	if a > 0 and b > 0:
		return a*b
	else:
		raise ValueError('Стороны должны быть неотрицательны')

def perimeter(a,b):
#Принимает длины сторон, равные a,b(десятичные целые числа), 
#   возвращает периметр, равный 2*(a*b)
#   Пример: perimeter(2,5) = 20 (десятичное целое число)
	if a > 0 and b > 0:
		return 2*(a+b) 
	else:
		raise ValueError('Стороны должны быть неотрицательны')
