
def area(a):
#Возвращает площадь квадрата в формате int
#	Параметры:
#		a(int) :  длина стороны квадрата 
#	Пример: area(10) = 100
    if a >= 0:
        return a * a
    else:
        raise ValueError('Сторона квадрата не может быть отрицательной')


def perimeter(a):
#Возвращает периметр квадрата в формате int
#	Параметры:
#		a(int) :  длина стороны квадрата 
#	Пример: perimeter(10) = 40
    if a >= 0:
        return 4 * a
    else:
        raise ValueError('Сторона квадрата не может быть отрицательной')