def area(a,h):
#Принимает длину стороны(a,целое десятичное число) и высоты(h,целое десятичное число), 
#   проведённой к ней. Возвращает площадь равную a*h/2 в формате float
	if a >= 0 and h >= 0:
		return a*h/2 
	else:
		raise ValueError('Стороны должны быть неотрицательными')

def perimeter(a,b,c):
#Принимает длину сторон(a,b,c - целые десятичные числа), 
#   Возвращает периметр  равный a*b*c в формате int
	if a >= 0 and b >= 0 and c >= 0:
		return a+b+c
	else: 
		raise ValueError('Стороны должны быть неотрицательными')
